Tawank/BruceOS/boards/m5stack-cplus2/sdkconfig.defaults
# M5StickC Plus2 (ESP32-PICO-V3-02, ST7789V2 135x240).
#
# Selected via `python tools/board.py m5stack-cplus2 build` (see
# tools/board.py), which passes this file through SDKCONFIG_DEFAULTS after
# the shared sdkconfig.defaults. The build system automatically also loads
# sdkconfig.defaults.esp32 (classic-BT / IRAM tuning) since this target is
# plain esp32, per ESP-IDF's target-dependent sdkconfig defaults rule.
CONFIG_IDF_TARGET="esp32"
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Display: SPI2_HOST, ST7789V2 135x240 physical panel, portrait (rotation 3).
CONFIG_BRUCE_DISPLAY_WIDTH=135
CONFIG_BRUCE_DISPLAY_HEIGHT=240
CONFIG_BRUCE_DISPLAY_DEFAULT_ROTATION=3
CONFIG_BRUCE_DISPLAY_SPI_HOST=1
CONFIG_BRUCE_DISPLAY_PIN_MOSI=15
CONFIG_BRUCE_DISPLAY_PIN_SCK=13
CONFIG_BRUCE_DISPLAY_PIN_CS=5
CONFIG_BRUCE_DISPLAY_PIN_DC=14
CONFIG_BRUCE_DISPLAY_PIN_RST=12
CONFIG_BRUCE_DISPLAY_PIN_BL=27

# Audio: LEDC PWM buzzer.
CONFIG_BRUCE_AUDIO_BACKEND_LEDC_BUZZER=y
CONFIG_BRUCE_AUDIO_BUZZER_GPIO=2

# Battery.
CONFIG_BRUCE_BATTERY_ENABLED=y
CONFIG_BRUCE_BATTERY_ADC_CHANNEL=2

# No SD card slot on this board.
# CONFIG_BRUCE_SD_ENABLED is not set

# Buttons: A/B/C discrete buttons; no select button.
# CONFIG_BRUCE_BUTTON_SELECT_ENABLED is not set
CONFIG_BRUCE_BUTTON_A_ENABLED=y
CONFIG_BRUCE_BUTTON_A_GPIO=35
CONFIG_BRUCE_BUTTON_A_REMAP_CODE=265
CONFIG_BRUCE_BUTTON_B_ENABLED=y
CONFIG_BRUCE_BUTTON_B_GPIO=37
CONFIG_BRUCE_BUTTON_B_REMAP_CODE=10
CONFIG_BRUCE_BUTTON_C_ENABLED=y
CONFIG_BRUCE_BUTTON_C_GPIO=39
CONFIG_BRUCE_BUTTON_C_REMAP_CODE=266

# No GPIO matrix keyboard on this board.
# CONFIG_BRUCE_KEYBOARD_ENABLED is not set

# Infrared.
CONFIG_BRUCE_IR_TX_GPIO=19
CONFIG_BRUCE_IR_RX_GPIO=33

# NRF24.
CONFIG_BRUCE_NRF24_SCK_GPIO=0
CONFIG_BRUCE_NRF24_MISO_GPIO=33
CONFIG_BRUCE_NRF24_MOSI_GPIO=32
CONFIG_BRUCE_NRF24_CS_GPIO=26
CONFIG_BRUCE_NRF24_CE_GPIO=25
